/*
Задача 1
-----------------------
Створити інтерфейс Лікар.
Інтерфейс має метод "лікувати", який приймає орган, що потрібно вилікувати.

Створити абстрактний клас Хірург, який має
- масив інструментів
- метод "Оперувати", який на вхід приймає інструмент для операції. Якщо у лікаря є такий інструмент -
операція успішна, якщо немає - операцію зробити не можна.

Створити клас Стоматолог, який розширює клас Хірурга.
Стоматолог перед тим, як лікувати, має перевірити, чи орган операції зуб. Якщо не зуб - операцію здійснити неможливо.
 */
package OOP.Lesson3.Task1;
public interface Doctorable {
    public void doctor (String organ); //doctor - лікувати
}
